routes/web.php

select * from `menus` where `menus`.`menu_id` in (1, 2)
---
|
*/

Route::get('/', function () {
//    $menus = \App\Models\Menu::with('children.children.children')->root()->get();
    $menus = \App\Models\Menu::tree();

    return view('welcome', [
        'menus' => $menus
    ]);
});