app/Http/Controllers/Api/Dashboard/ItemController.php

select * from `items`
select `id`, `name` from `menus` where `menus`.`id` in (3, 5, 7)
---
    public function index()
    {
        $items = Item::with('menu:id,name')->get();