app/Http/Controllers/Api/Dashboard/MenuController.php

    public function index()
    {
        $menus = Menu::with('parent')->get();
---
select * from `menus` where `menus`.`id` in (1, 4, 6, 9)