app/Http/Controllers/MenuController.php

    public function index()
    {
        $menus = Menu::with('parent')->get();
---
select * from `menus` where `menus`.`id` in (1, 4, 6)

    public function create()
    {
        $menus = Menu::where('type', 'category')->select(['id', 'name'])->get();
---
select `id`, `name` from `menus` where `type` = 'category'

    public function store(StoreMenuRequest $request)
    {
        // Query about the parent to know his type and discount.
        $parentMenu = Menu::where('id', $request->menu_id)->first();
        // Menu must not have mixed children
        // The parent menu only accepts the items.
        if ($request->menu_id != null and $parentMenu->type == 'item') {
            return response()->json(['message' => 'The menu cannot be created. The parent menu only accepts the items.']);
        }

        // Inherit the discount menu from the parent if the menu does not have a discount.
        if ($request->menu_id != null and $request->discount == null) {
            $request->merge(['discount' => $parentMenu->discount]);
        }

        $menu = Menu::create($request->all());
---
select * from `menus` where `id` = 9 limit 1
insert into `menus` (`name`, `type`, `menu_id`, `discount`, `updated_at`, `created_at`) values ('cat 11)', 'category', 9, 30, '2022-11-12 16:15:43', '2022-11-12 16:15:43')

    public function update(UpdateMenuRequest $request, Menu $menu)
    {
        // Prevent update if the TYPE is changed and the menu HAS children (menus or items)
        $TypeIsChanged = $request->type != $menu->type;
        if ($TypeIsChanged) {
            $menuHasChildrenMenu  = $menu->children->count() > 0;
            $menuHasChildrenItem = $menu->items->count() > 0;
            if ($menuHasChildrenMenu  or $menuHasChildrenItem) {
                return response()->json(['message' => 'The menu cannot be update. It is not possible to change the (type) of menu that has children.']);
            }
        }

        // Menu must not have mixed children
        // Query about the parent to know his type.
        $parentMenu = Menu::where('id', $request->menu_id)->first();
        // The parent menu only accepts the items.
        if ($request->menu_id != null and $parentMenu->type == 'item') {
            return response()->json(['message' => 'The menu cannot be update. The parent menu only accepts the items.']);
        }

        // Query about the children Who inherit the discount
        $child = Menu::where('menu_id', $menu->id)->where('discount', $menu->discount)->get();
---
select * from `items` where `items`.`menu_id` = 9 and `items`.`menu_id` is not null
select * from `menus` where `id` is null limit 1
select * from `menus` where `menu_id` = 9 and `discount` = 30

            }
        }
        // Update the affected submenus
        DB::table('menus')->whereIn('id', $affectedArray)
            ->update(['discount' => $request->discount]);
        // Update affected items
        DB::table('items')->whereIn('menu_id', $affectedArray)->where('discount', $menu->discount)
            ->update(['discount' => $request->discount]);

        // Update the selected sub menu
        $menu = $menu->update($request->all());
---
update `menus` set `discount` = 30 where 0 = 1
update `items` set `discount` = 30 where 0 = 1 and `discount` = 30
update `menus` set `type` = 'category', `menus`.`updated_at` = '2022-11-12 16:15:15' where `id` = 9