app/Models/Menu.php

select * from `menus`
---
    public static function tree()
    {
        $allMenus = Menu::get();